---
kind: type
id: T:Autodesk.Revit.DB.PhaseFilter
source: html/3236c80e-48be-f657-951f-70490a43f065.htm
---
# Autodesk.Revit.DB.PhaseFilter

Represents an phase filter within Autodesk Revit.

## Syntax (C#)
```csharp
public class PhaseFilter : Element
```